# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\almsk\Dropbox\P5 - B2-203\Projekt\PSoC\SampleOgMotor\Project_Done_V0.4DisCon\Project_Done_V0.4DisCon.cydsn\Project_Done_V0.4DisCon.cyprj
# Date: Mon, 16 Dec 2019 09:45:16 GMT
#set_units -time ns
create_clock -name {Clock_soc(routed)} -period 1264.705882352941 -waveform {0 632.35294117647} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 29.411764705882351 -waveform {0 14.7058823529412} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 29.411764705882351 -waveform {0 14.7058823529412} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_PWM} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_PWM_step} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_aclk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 37 73} -nominal_period 1088.2352941176468 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_soc} -source [get_pins {ClockBlock/clk_sync}] -edges {1 43 85} -nominal_period 1264.705882352941 [list [get_pins {ClockBlock/dclk_glb_3}]]


# Component constraints for C:\Users\almsk\Dropbox\P5 - B2-203\Projekt\PSoC\SampleOgMotor\Project_Done_V0.4DisCon\Project_Done_V0.4DisCon.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\almsk\Dropbox\P5 - B2-203\Projekt\PSoC\SampleOgMotor\Project_Done_V0.4DisCon\Project_Done_V0.4DisCon.cydsn\Project_Done_V0.4DisCon.cyprj
# Date: Mon, 16 Dec 2019 09:45:07 GMT
